Heliobteixeira/botieyes/esp-idf/sdkconfig.defaults
# ST7789 Display Configuration for TENSTAR TS-ESP32-S3
#
# Board: TENSTAR TS-ESP32-S3 Development Board
# Display: 1.14" ST7789 TFT (135x240 RGB565)
# Chip: ESP32-S3-WROOM-1
#
# IMPORTANT: This board uses ESP32-S3 native GPIO pins, NOT ESP32 pins!
# The pinout differs from TTGO T-Display (ESP32 classic).

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Disable old board detection options (obsolete from earlier phases)
CONFIG_BOTIEYES_BOARD_TTGO_LORA32=
CONFIG_BOTIEYES_BOARD_ESP32S3_SPI=
CONFIG_BOTIEYES_OLED_PROTOCOL_I2C=
CONFIG_BOTIEYES_OLED_PROTOCOL_SPI=

# Display Type Selection
CONFIG_DISPLAY_TYPE_ST7789_SPI=y

# Enable frame buffer for fast rendering (240×135 RGB565 = 65KB)
# Without this, direct pixel rendering is ~100x slower
CONFIG_FRAME_BUFFER=y

# GPIO Pin Configuration (TENSTAR TS-ESP32-S3 - VERIFIED FROM DOCUMENTATION)
# Based on TFT_eSPI library configuration for this board
CONFIG_MOSI_GPIO=35
CONFIG_SCLK_GPIO=36
CONFIG_CS_GPIO=7
CONFIG_DC_GPIO=39
CONFIG_RESET_GPIO=40
CONFIG_BL_GPIO=45

# Display Dimensions (1.14" ST7789 - Landscape orientation)
CONFIG_WIDTH=240
CONFIG_HEIGHT=135

# GRAM Offsets (ST7789 320×240 GRAM, 240×135 visible window)
# Calibrated values for TENSTAR TS-ESP32-S3 - verified working
CONFIG_OFFSETX=40
CONFIG_OFFSETY=53

# SPI Configuration
CONFIG_SPI2_HOST=y
# CONFIG_SPI3_HOST is not set

# SPI Clock Speed (start conservative, increase if stable)
CONFIG_ST7789_SPI_CLOCK_MHZ=20

# Frame Buffer (optional - uses ~65KB RAM)
# CONFIG_FRAME_BUFFER=y

# Display Inversion (test if colors are inverted)
# CONFIG_INVERSION=n

# ESP32-S3 USB Configuration (critical for boot mode)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART is not set
